# Названия запросов
GET_SCHEDULE_FOR_CLASS = """
    -- Получить расписание для конкретного класса
"""

GET_TEACHERS_FOR_CLASS = """
    -- Получить список учителей для заданного класса
"""

GET_CLASSROOM_FOR_LESSON = """
    -- Получить кабинет для конкретного урока
"""

GET_CLASSES_FOR_TEACHER = """
    -- Получить классы, в которых учитель преподает заданный предмет
"""

GET_DAILY_SCHEDULE_FOR_CLASS = """
    -- Получить расписание на день для заданного класса
"""

GET_CLASS_STATISTICS = """
    -- Получить количество учеников в классе
"""

GET_OVERALL_STATISTICS = """
    -- Общая статистика по школе
"""

GET_GRADE_DISTRIBUTION = """
    -- Распределение оценок (двоечники, хорошисты, отличники)
"""
